## 1.2 프로그래밍 패러다임

- #### 명령형 프로그래밍 : 어떻게(How) 할 것인지 설명하는 방식
  - 절차지향 프로그래밍 : 수행되어야 할 순차적인 처리과정을 포함하는 방식 (C, C++)
  - 객체지향 프로그래밍 : 객체들의 집합으로 프로그램의 상호작용을 표현 (C++, Java, C#)
- #### 선언형 프로그래밍 : 무엇을(what) 할 것인지 설명하는 방식
      * 함수형 프로그래밍 : 순수 함수를 조합하고 소프트웨어를 만드는 방식 (클로저, 하스켈, 리스프)
  <hr>

### 1.1.1 선언형과 함수형 프로그래밍

### 장점

- 작은 문제를 해결하기 위해 함수 작성하여 가독성 높이고 유지보수 용이

### 주요 용어

- **부수효과**
  - 변수의 값이 변경되거나
  - 자료구조를 제자리에서 수정하거나
  - 객체의 필드값을 설정하거나
  - 예외나 오류가 발생하여 실행이 중단되거나
  - 콘솔 또는 파일 I/O가 발생하는 경우
- **순수함수**
  - 위와 같은 부수효과를 제거한 함수
  - 출력이 입력에만 의존하는 함수
  - 즉, 함수의 실행이 외부에 영향을 끼지지 않는 함수
- **순수함수의 장점**
  - 함수 자체가 독립적이고 side-effect가 없어 Thread-Safe하다
  - 이로 인해 병렬처리를 동기화 없이 진행 가능
- **고차함수**
  - 함수가 함수를 값처럼 매개변수로 받아 로직 작성할 수 있음 (JavaScript?) 
- **1급 객체**
  - 변수나 메서드에 함수 할당 가능
  - 함수 안에 함수를 매개변수로 할당 가능
  - 함수를 반환값으로 사용 가능
  - 할당에 사용된 이름과 무관하게 고유한 구별이 가능
- **참조 투명성**

  - 동일한 인자에 대해 항상 동일한 결과를 반환
  - 이를 통해 기존의 값은 변경되지 않고 유지

  -> 명령형 프로그래밍과 함수형 프로그래밍에서 사용하는 함수는 부수효과의 유/무에 따라 차이가 있다. 그에 따라 함수가 참조에 투명한지 안한지 나뉘어 지는데, 참조에 투명하다는 것은 말 그대로 함수를 실행하여도 어떠한 상태의 변화 없이 항상 동일한 결과를 반환하여 항상 동일하게(투명하게) 실행 결과를 참조(예측)할 수 있다는 것을 의미

<hr>

### 1.1.2 객체지향 프로그래밍 (OOP)

객체들의 집합으로 프로그램의 상호 작용을 표현하며 데이터를 객체로 취급하여 객체 내부에 선언된 메서드, 변수를 활용하는 방식. 타 프로그래밍 패러다임에 비해 처리속도가 느리고 설계적으로 많은 시간이 소요.

#### 객체지향 프로그래밍의 특징

- #### 추상화
  객체의 공통적인 기능과 속성을 추출하여 정의하는 것.
- #### 캡슐화
  객체의 속성과 메서드를 하나로 묶고 일부를 감추어 보호 & 은닉하는 것. 외부 사용자가 코드를 임의로 수정하는 것을 방지
  - private < default < protected < public
- #### 상속
  기존 클래스를 재활용하여 추가, 확장하는 것. 코드 재사용, 계층 관계 생성, 유지보수적으로 유리
- #### 다형성
  어떤 객체의 속성이나 기능이 상황에 따라 여러가지 형태를 가질 수 있는 성질. 오버로딩, 오버라이딩, 제네릭스가 대표적인 예시.
  - **오버로딩** : 같은 이름을 가진 메서드를 여러 개 두는 것으로 메서드의 타입, 매개변수의 유형, 개수 등으로 구분. **컴파일 중 발생하는 정적 다형성 기능**
  - **오버라이딩** : 상위 클래스로부터 상속받은 메서드를 하위 클래스에서 재정의 하는 것. **런타임 중 발생하는 동적 다형성**

참조 : <https://velog.io/@injoon2019/%EB%AA%85%EB%A0%B9%ED%98%95-vs-%EC%84%A0%EC%96%B8%ED%98%95-%ED%95%A8%EC%88%98%ED%98%95>

<hr>
### SOLID 원칙

### 설계 원칙 (SOLID)

### S : Single Responsibility Principle (단일 책임 원칙)

<aside>
💡 하나의 객체는 반드시 하나의 동작만의 책임을 갖는다.

</aside>

모듈화가 강해질수록 다른 객체와의 의존/연관성이 줄어든다.

반대로 모듈화가 약해진다면 다른 객체와의 의존/연관성은 크게 늘어나며, 최악의 경우 어떠한 은닉화 정책도 존재하지 않아 모듈의 메소드에 무분별하게 접근할 수도 있게 된다.

**객체가 담당하는 동작, 즉 책임이 많아질수록 해당 객체의 변경에 따른 영향도의 크기와 범위가 커진다.**

**⇒ 단일 책임 원칙은 특정 객체의 책임 의존성 과중을 최대한 지양하기 위한 원칙**

- **코드로 살펴보자**

  ### 수정 전 코드

  ```java
  /**
   * 자동차 객체
   *
   * @author RWB
   * @since 2021.08.13 Fri 00:14:14
   */
  public class Car
  {
      private final String WD;

      private final int[] WHEEL = { 0, 0, 0, 0 };

      /**
       * Car 생성자 함수
       *
       * @param wd: [String] 휠 구동 방식
       */
      public Car(String wd)
      {
          WD = wd;
      }

      /**
       * 주행 함수
       *
       * @param power: [int] 동력
       */
      public void run(int power)
      {
          switch (WD.toUpperCase())
          {
              case "FWD" -> {
                  WHEEL[0] = power;
                  WHEEL[1] = power;
              }

              case "RWD" -> {
                  WHEEL[3] = power;
                  WHEEL[4] = power;
              }

              case "AWD" -> {
                  WHEEL[0] = power;
                  WHEEL[1] = power;
                  WHEEL[3] = power;
                  WHEEL[4] = power;
              }
          }

          System.out.println("휠 동력 상태: " + WHEEL[0] + ", " + WHEEL[1] + ", " + WHEEL[2] + ", " + WHEEL[3]);
      }
  }

  ```

  위 Car 객체는 무려 3가지의 휠 구동 방식에 따른 역할을 수행하게 된다. 이렇게 하나의 객체에 너무 많은 책임이 몰려있을 경우, 프로젝트에서 해당 객체의 의존성이 너무 높아지며 이는 객체 지향의 주요 특징인 캡슐화를 부정하는 결과이다.
  **⇒ 1 객체, 1 책임으로 최대한 객체를 간결하고 명확하게 설계해보자**

  ### 개선 코드

  ```java
  /**
   * 자동차 추상 객체
   */
  abstract public class Car
  {
      protected final String WD;

      protected final int[] WHEEL = { 0, 0, 0, 0 };

      public Car(String wd)
      {
          WD = wd;
      }

      abstract public void run(int power);
  }
  ```

  우선적으로 공통된 인터페이스 내지는 상위 객체를 구현한다. 생성자가 필요하기 때문에 인터페이스보다는 상위 추상 클래스가 적합하다.

  ```java
  /**
   * 전륜차 객체
   */
  class FrontWheelCar extends Car
  {

      public FrontWheelCar(String wd)
      {
          super(wd);
      }

      @Override
      public void run(int power)
      {
          WHEEL[0] = power;
          WHEEL[1] = power;

          System.out.println("휠 동력 상태: " + WHEEL[0] + ", " + WHEEL[1] + ", " + WHEEL[2] + ", " + WHEEL[3]);
      }
  }
  /**
   * 후륜차 객체
   */
  class RearWheelCar extends Car
  {
      public RearWheelCar(String wd)
      {
          super(wd);
      }

      @Override
      public void run(int power)
      {
          WHEEL[2] = power;
          WHEEL[3] = power;

          System.out.println("휠 동력 상태: " + WHEEL[0] + ", " + WHEEL[1] + ", " + WHEEL[2] + ", " + WHEEL[3]);
      }
  }

  /**
   * 사륜차 객체
   */
  public class AllWheelCar extends Car
  {
      public AllWheelCar(String wd)
      {
          super(wd);
      }

      @Override
      public void run(int power)
      {
          WHEEL[0] = power;
          WHEEL[1] = power;
          WHEEL[2] = power;
          WHEEL[3] = power;

          System.out.println("휠 동력 상태: " + WHEEL[0] + ", " + WHEEL[1] + ", " + WHEEL[2] + ", " + WHEEL[3]);
      }
  }
  ```

  전륜, 후륜, 사륜에 해당하는 객체를 생성했다. 이 객체는 모두 Car에 포함됨으로 Car를 상속받아 구현하고 run() 메소드에 동작을 구현함으로써, 각각의 객체가 하나의 책임을 가지게 된다.
  ⇒ 객체별로 책임을 나누면 의존성이 낮아져 코드 변경 시에도 해당하는 객체만 수정하면 된다. 또한 코드도 간결해져 유지보수가 쉬워지고 수정에 따른 영향도가 매우 작아진다.

### O : Open-Closed Priciple (개방-폐쇄 원칙)

<aside>
💡 객체를 다룸에 있어서 객체의 확장은 개방적으로, 객체의 수정은 폐쇄적으로 대하는 원칙이다.

</aside>

**기능이 변하거나 확장 가능하지만 해당기능의 코드는 수정하면 안된다.**

⇒ HOW?

객체 하나를 수정할 때, 단순히 객체만 수정하는 것 뿐만 아니라 해당 객체에 의존하는 다른 객체의 코드까지 모두 고쳐야 한다면 좋은 설계로 보기 힘들다. 예시로 라이브러리를 사용하는 객체의 코드가 바뀌었다고 라이브러리 코드까지 변경하지 않는다.

각 객체의 모듈화와 정보 은닉의 올바른 구현을 추구하며, **이를 통해 객체 간의 의존성을 최소화하여 코드 변경에 따른 영향력을 낮추기 위한 원칙이다**.

- **코드로 알아보자**

  ### 수정 전 코드

  ```java
  /**
   * 포스 클래스

   */
  public class Pos
  {
      /**
       * 결제 및 결과 반환 함수
       *
       * @param card : [Object] 카드 객체
       * @param name : [String] 카드사명
       * @param price: [int] 금액
       *
       * @return [boolean] 결제 결과
       */
  public boolean purchase(String card, int price)
  {
      boolean result;

      switch (card.toUpperCase())
      {
          // 신생 업체가 생길 때마다 해당 업체를 구분하는 로직을 추가한다.
          case "A" -> result = ((CardA) card).send(price);
          case "B" -> result = ((CardB) card).send(price);
          case "C" -> result = ((CardC) card).send(price);
          // case "D" -> result = ((CardD) card).send(price);
          // case "E" -> result = ((CardE) card).send(price);
          // case "F" -> result = ((CardF) card).send(price);

          default -> {
              System.out.println("유효하지 않은 카드사");
              result = false;
          }
      }

      return result;
  	}
  }
  ```

  매우 비효율적이고, 동일 반복이 많다. 범위가 늘어날 수록 같은 문제가 반복된다.

  ### 개선 코드

  ```java
  /**
   * 결제 인터페이스
   *
   * @author RWB
   * @since 2021.08.14 Sat 02:28:22
   */
  public interface Purchasable
  {
      /**
       * 카드사 정보 전송 및 결과 반환 함수
       *
       * @param price: [int] 금액
       *
       * @return [boolean] 전송 결과
       */
      boolean send(int price);
  }
  ```

  리더기에서 전송하는 든 카드 객체를 이 인터페이스를 상속받도록 강제

  ```java
  /**
   * A 카드
   */
  class CardA implements Purchasable
  {
      /**
       * 카드사 정보 전송 및 결과 반환 함수
       *
       * @param price: [int] 금액
       *
       * @return [boolean] 전송 결과
       */
      @Override
      public boolean send(int price)
      {
          System.out.println(getClass().getSimpleName() + " " + price + "원 결제 요청");
          return true;
      }
  }
  /**
   * B 카드 객체
   */
  class CardB implements Purchasable
  {

      @Override
      public boolean send(int price)
      {
          System.out.println(getClass().getSimpleName() + " " + price + "원 결제 요청");
          return true;
      }
  }
  /**
   * C 카드 객체
   */
  class CardC implements Purchasable
  {

      @Override
      public boolean send(int price)
      {
          System.out.println(getClass().getSimpleName() + " " + price + "원 결제 요청");
          return true;
      }
  }
  ```

  모든 카드 객체는 Purchasable 인터페이스를 상속받았다. 각 카드 객체의 동작에 전송이 구현되어 있어, 이제 타 객체의 코드(수정 전 코드의 purchase)에 의존하지 않는다

  ```java
  /**
   * 포스 클래스
   */
  public class Pos
  {
      /**
       * 결제 및 결과 반환 함수
       * @param purchasable : [Purchasable] Purchasable 인터페이스
       * @param price: [int] 금액
       * @return [boolean] 결제 결과
       */
      public boolean purchase(Purchasable purchasable, int price)
      {
          return purchasable.send(price);
      }
  }
  ```

  이제 결제함수를 리팩토링해보자. CardA ~ CardC 모두 개별객체이지만 Purchasable 부모 객체가 있음으로 이를 묶을 수 있다. 따라서 우리는 리더기에서 주는 인터페이스 객체만 받아서 해당 객체의 send를 호출하면 된다.

### L : Liskov Subsitution Priciple (리스코프 치환 원칙)

<aside>
💡 부모 객체와 이를 상속한 자식 객체가 있을 때, **부모 객체를 호출하는 동작에서 자식 객체가 부모 객체를 완전히 대체할 수 있어야 한다.**

</aside>

자식 객체는 부모 객체의 특성을 가지며, 이를 토대로 확장할 수 있다. 하지만 이 과정에서 무리하거나 객체의 의의와 어긋나는 확장으로 잘못된 방향으로 상속되는 경우가 있다. 리스코프 원칙은 올바른 상속을 위해 자식 객체의 확장이 부모 객체의 방향을 온전히 따르도록 권고하는 원칙이다.

이를 지키기 위해서 가급적 부모 객체의 일반 메소드를 그 의도와 다르게 오버라이딩 하지 않는 것이 중요하다. 부모 객체의 오버라이딩은 주로 동일한 메소드를 자식 객체만의 동작을 추가하기 위해 한다는 것을 감안하면 준수하기 까다로운 원칙.

- **코드로 알아보자**

  ### 수정 전 코드

  ```java
  /**
   * 직사각형 클래스
   *
   * @author RWB
   * @since 2021.08.14 Sat 11:12:44
   */
  public class Rectangle
  {
      protected int width;
      protected int height;

      /**
       * 너비 반환 함수
       *
       * @return [int] 너비
       */
      public int getWidth()
      {
          return width;
      }

      /**
       * 높이 반환 함수
       *
       * @return [int] 높이
       */
      public int getHeight()
      {
          return height;
      }

      /**
       * 너비 할당 함수
       *
       * @param width: [int] 너비
       */
      public void setWidth(int width)
      {
          this.width = width;
      }

      /**
       * 높이 할당 함수
       *
       * @param height: [int] 높이
       */
      public void setHeight(int height)
      {
          this.height = height;
      }

      /**
       * 넓이 반환 함수
       *
       * @return [int] 넓이
       */
      public int getArea()
      {
          return width * height;
      }
  }
  ```

  직사각형 클래스를 만들었다. 정사각형은 직사각형에 포함되니 이를 상속하면 만들 수 있지 않을까?

  ```java
  /**
   * 정사각형 클래스
   */
  public class Square extends Rectangle
  {
      /**
       * 너비 할당 함수
       *
       * @param width: [int] 너비
       */
      @Override
      public void setWidth(int width)
      {
          super.setWidth(width);
          super.setHeight(getWidth());
      }

      /**
       * 높이 할당 함수
       *
       * @param height: [int] 높이
       */
      @Override
      public void setHeight(int height)
      {
          super.setHeight(height);
          super.setWidth(getHeight());
      }

  ```

  ```java
  /**
   * 메인 클래스
   */
  public class Main
  {
      /**
       * 메인 함수
       *
       * @param args: [String[]] 매개변수
       */
      public static void main(String[] args)
      {
          Rectangle rectangle = new Rectangle();
          rectangle.setWidth(10);
          rectangle.setHeight(5);
          System.out.println(rectangle.getArea()); // 50 (정상)

  				Rectangle rectangle = new Square();
          rectangle.setWidth(10);
          rectangle.setHeight(5);
          System.out.println(rectangle.getArea()); // 25 (에러, 50 나와야함)
      }
  }
  ```

  리스코프 치환 원칙에 의하면, 자식 객체는 부모 객체를 완전히 대체할 수 있음으로 직사각형 클래스를 상속받은 정사각형 클래스는 동일한 결과가 나와야하나 마지막에 수행된 setHeight(5)가 객체의 너비/높이를 모두 5로 할당했다.
  잘 생각해보면 정사각형이 직사각형에 포함되기는 하나 이는 각도라는 개념이 포함되어야 한다. 즉, 하나가 다른 하나를 완전히 포함하지 못하는 구조다 (?)

  ### 수정 후 코드

  ```java
  /**
   * 사각형 객체
   */
  public class Shape
  {
      protected int width;
      protected int height;

      /**
       * 너비 반환 함수
       *
       * @return [int] 너비
       */
      public int getWidth()
      {
          return width;
      }

      /**
       * 높이 반환 함수
       *
       * @return [int] 높이
       */
      public int getHeight()
      {
          return height;
      }

      /**
       * 너비 할당 함수
       *
       * @param width: [int] 너비
       */
      public void setWidth(int width)
      {
          this.width = width;
      }

      /**
       * 높이 할당 함수
       *
       * @param height: [int] 높이
       */
      public void setHeight(int height)
      {
          this.height = height;
      }

      /**
       * 넓이 반환 함수
       *
       * @return [int] 넓이
       */
      public int getArea()
      {
          return width * height;
      }
  }
  ```

  직사각형과 정사각형이 상속의 관계가 성립되기 어렵다면, 이보다 더 상위 클래스인 사각형 클래스를 구현하고 이를 상속받게 하면 된다

  ```java
  /**
   * 직사각형 클래스
   */
  class Rectangle extends Shape
  {
      /**
       * Rectangle 생성자 함수
       * @param width: [int] 너비
       * @param height: [int] 높이
       */
      public Rectangle(int width, int height)
      {
          setWidth(width);
          setHeight(height);
      }
  }
  /**
   * 정사각형 클래스
   */
  class Square extends Shape
  {
      /**
       * Square 생성자 함수
       * @param length: [int] 길이
       */
      public Square(int length)
      {
          setWidth(length);
          setHeight(length);
      }
  }
  ```

  직사각형은 width, height를 파라미터로 받으며, 정사각형은 length 하나만을 파라미터로 받고 둘다 사각형을 상속받는다

  ```java
  /**
   * 메인 클래스
   */
  public class Main
  {
      /**
       * 메인 함수
       *
       * @param args: [String[]] 매개변수
       */
      public static void main(String[] args)
      {
          Shape rectangle = new Rectangle(10, 5);
          Shape square = new Square(5);
          System.out.println(rectangle.getArea());
          System.out.println(square.getArea());
      }
  }
  ```

  이제 더 이상 직사각형과 정사각형은 상속 관계가 아니므로, 리스코프 치환 원칙의 영향에서 벗어났다.

### I : Interface Segregation Principle (인터페이스 분리 원칙)

<aside>
💡 객체는 자신이 호출하지 않는 메소드에 의존하지 않아야 한다. **(객체는 반드시 필요한 기능만 가진다)**

</aside>

**구현할 객체에게 무의미한 메소드의 구현을 방지하기 위해 반드시 필요한 메소드만을 상속/구현하도록 권고**한다. 만약 상속할 객체의 규모가 너무 크다면, 해당 객체의 메소드를 작은 인터페이스로 나누는 것이 좋다.

왼쪽과 오른쪽 객체가 가운데 객체를 각각 상속할 경우, 왼쪽 객체는 필요한 메소드가 모두 구현되기 때문에 문제가 없지만 오른쪽 객체의 경우 method1을 제외한 나머지 메소드는 필요가 없음에도 이를 상속했기 때문에 필요없는 메소드를 구현해야하는 경우가 생긴다.

⇒ 상속 대상인 객체의 메소드를 각 동작별로 구분해 인터페이스로 만들어본다면, 각 객체가 필요한 인터페이스만큼 상속하여 구현하면 된다!

- **코드로 알아보자**

  ### 수정 전 코드

  ```java
  /**
   * 스마트폰 추상 객체
   */
  abstract public class SmartPhone
  {
      /**
       * 통화 함수
       * @param number: [String] 번호
       */
      public void call(String number)
      {
          System.out.println(number + " 통화 연결");
      }

      /**
       * 문자 메시지 전송 함수
       * @param number: [String] 번호
       * @param text: [String] 내용
       */
      public void message(String number, String text)
      {
          System.out.println(number + ": " + text);
      }

      /**
       * 무선충전 함수
       */
      public void wirelessCharge()
      {
          System.out.println("무선 충전");
      }

      /**
       * AR 함수
       */
      public void ar()
      {
          System.out.println("AR 기능");
      }

      /**
       * 생체인식 추상 함수
       */
      abstract public void biometrics();
  }
  ```

  ```java
  /**
   * S20 객체
   */
  public class S20 extends SmartPhone
  {
      /**
       * 생체인식 함수
       */
      @Override
      public void biometrics()
      {
          System.out.println("S20 생체인식 기능");
      }
  }
  // 이외 다른 메소드 모두 상속 필요, 불필요한 메소드 없음

  /**
   * S2 객체
   */
  public class S2 extends SmartPhone
  {
      /**
       * 무선충전 함수
       */
      @Override
      public void wirelessCharge()
      {
          System.out.println("지원 불가능한 기기");
      }

      /**
       * AR 함수
       */
      @Override
      public void ar()
      {
          System.out.println("지원 불가능한 기기");
      }

      /**
       * 생체인식 추상 함수
       */
      @Override
      public void biometrics()
      {
          System.out.println("지원 불가능한 기기");
      }
  }
  ```

  S20은 모든 기능이 필요하기 때문에, SmartPhone의 모든 메소드를 사용해야 함으로 불필요한 메소드가 없으나, S2는 불필요한 메소드를 강제로 상속받게 된다. 더군다나 biometrics()의 경우 추상 메소드임으로 필요하지도 않은 기능을 구현까지 해야한다.

  ### 개선 코드

  ```java
  /**
   * 스마트폰 객체
   */
  public class SmartPhone
  {
      /**
       * 통화 함수
       * @param number: [String] 번호
       */
      public void call(String number)
      {
          System.out.println(number + " 통화 연결");
      }

      /**
       * 문자 메시지 전송 함수
       * @param number: [String] 번호
       * @param text: [String] 내용
       */
      public void message(String number, String text)
      {
          System.out.println(number + ": " + text);
      }
  }
  ```

  ```java
  /**
   * 무선충전 인터페이스
   */
  public interface WirelessChargable
  {
      /**
       * 무선충전 추상 함수
       */
      void wirelessCharge();
  }
  /**
   * AR 인터페이스
   */
  public interface ARable
  {
      /**
       * AR 추상 함수
       */
      void ar();
  }
  /**
   * 생체인식 인터페이스
   */
  public interface Biometricsable
  {
      /**
       * 생체인식 추상 함수
       */
      void biometrics();
  }
  ```

  가장 대표적인 스마트폰 기능만 클래스로 구현하고 나머지 특수 기능은 인터페이스로 구현한다.

  ```java
  /**
   * S20 객체
   */
  public class S20 extends SmartPhone implements WirelessChargable, ARable, Biometricsable
  {
      /**
       * 무선충전 함수
       */
      @Override
      public void wirelessCharge()
      {
          System.out.println("무선충전 기능");
      }

      /**
       * AR 함수
       */
      @Override
      public void ar()
      {
          System.out.println("AR 기능");
      }

      /**
       * 생체인식 함수
       */
      @Override
      public void biometrics()
      {
          System.out.println("생체인식 기능");
      }
  }

  /**
   * S2 객체
   */
  public class S2 extends SmartPhone
  {
      /**
       * 문자 메시지 전송 함수
       *
       * @param number: [String] 번호
       * @param text: [String] 내용
       */
      @Override
      public void message(String number, String text)
      {
          System.out.println("In S2");

          super.message(number, text);
      }
  }
  ```

  특수기능이 불필요한 S2는 기본적인 SmartPhone 객체만을 상속받아 구현된다. S20은 클래스도 상속받았고 인터페이스로 WirelessChargable, ARable, Biometricsable를 모두 상속받아 구현하고 있다.

### D : Dependency Inversion Principle (의존성 역전 법칙)

<aside>
💡 **객체는 저수준 모듈보다 고수준 모듈에 의존해야한다**

</aside>

- 고수준 모듈 : 인터페이스와 같은 객체의 형태나 추상적 개념
- 저수준 모듈 : 구현된 객체

<aside>
💡 객체는 객체보다 인터페이스에 의존해야한다.

</aside>

의존성 역전 원칙은 코드의 확장성 및 재사용성을 추구하기 위한 원칙이다. 경직된 객체보다 구현되지 않아 유연한 인터페이스가 더욱 확장 가능성이 높을 것이다.

다른 원칙에 비해 중요도가 조금 떨어지는데, 이는 타 원칙의 하위호환 격이기 때문이다. 의존성 역전 법칙은 개방-폐쇄 원칙을 준수할 경우 자연스럽게 만족되기도 하고 단일 책임 원칙, 인터페이스 분리 원칙을 준수할 경우도 마찬가지다.

- **코드로 알아보자**

### 수정 전 코드

```java
import java.util.Random;
/**
 * 한손검 객체
 */
public class OneHandSword
{
    private final String NAME;
    private final int DAMAGE;

    /**
     * OneHandSword 생성자 함수
     *
     * @param name: [String] 무기 이름
     * @param damage: [int] 데미지
     */
    public OneHandSword(String name, int damage)
    {
        NAME = name;
        DAMAGE = damage;
    }

    /**
     * 공격 데미지 반환 함수
     *
     * @return [int] 공격 데미지 (데미지 +-5)
     */
    public int attack()
    {
        return DAMAGE + new Random().nextInt(10) - 5;
    }

    /**
     * 객체 문자열 반환 함수
     *
     * @return [String] 이름
     */
    @Override
    public String toString()
    {
        return NAME;
    }
}
```

```java
/**
 * 캐릭터 객체
 */
public class Character
{
    private final String NAME;
    private int health;
    private OneHandSword weapon;

    /**
     * Character 생성자 함수
     *
     * @param name: [String] 이름
     * @param health: [int] 체력
     * @param weapon: [OneHandSword] 무기
     */
    public Character(String name, int health, OneHandSword weapon)
    {
        NAME = name;
        this.health = health;
        this.weapon = weapon;
    }

    /**
     * 공격 데미지 반환 함수
     *
     * @return [int] 공격 데미지
     */
    public int attack()
    {
        return weapon.attack();
    }

    /**
     * 피격 함수
     *
     * @param amount: [int] 피격 데미지
     */
    public void damaged(int amount)
    {
        health -= amount;
    }

    /**
     * 무기 교체 함수
     *
     * @param weapon: [OneHandSword] 무기
     */
    public void chageWeapon(OneHandSword weapon)
    {
        this.weapon = weapon;
    }

    /**
     * 캐릭터 정보 출력 함수
     */
    public void getInfo()
    {
        System.out.println("이름: " + NAME);
        System.out.println("체력: " + health);
        System.out.println("무기: " + weapon);
    }
}
```

캐릭터의 무기는 한손검만 있는게 아니다. 그러나 위 클래스대로라면 애초에 한손검 외에는 쓸 수가 없다. Character 클래스 생성시 OneHandSword에 의존성을 가지기 때문이다.

이 상황에서 다른 무기를 사용하려면 캐릭터 클래스의 코드를 바꿔야 하며, 이는 개방-폐쇄 원칙을 위배한다.

### 개선 코드

```java
import java.util.Random;
/**
 * 한손검 객체
 */
public class OneHandSword implements Attackable
{
    private final String NAME;
    private final int DAMAGE;

    /**
     * OneHandSword 생성자 함수
     *
     * @param name: [String] 무기 이름
     * @param damage: [int] 데미지
     */
    public OneHandSword(String name, int damage)
    {
        NAME = name;
        DAMAGE = damage;
    }

    /**
     * 공격 데미지 반환 함수
     *
     * @return [int] 공격 데미지 (데미지 +-5)
     */
    @Override
    public int attack()
    {
        return DAMAGE + new Random().nextInt(10) - 5;
    }

    /**
     * 객체 문자열 반환 함수
     *
     * @return [String] 이름
     */
    @Override
    public String toString()
    {
        return NAME;
    }
}
```

Attackable 인터페이스를 상속받게 한손검 객체를 구현한다.

```java
/**
 * 캐릭터 객체
 */
public class Character
{
    private final String NAME;
    private int health;
    private Attackable weapon;

    /**
     * Character 생성자 함수
     *
     * @param name: [String] 이름
     * @param health: [int] 체력
     * @param weapon: [Attackable] 무기
     */
    public Character(String name, int health, Attackable weapon)
    {
        NAME = name;
        this.health = health;
        this.weapon = weapon;
    }

    /**
     * 공격 데미지 반환 함수
     *
     * @return [int] 공격 데미지
     */
    public int attack()
    {
        return weapon.attack();
    }

    /**
     * 피격 함수
     *
     * @param amount: [int] 피격 데미지
     */
    public void damaged(int amount)
    {
        health -= amount;
    }

    /**
     * 무기 교체 함수
     *
     * @param weapon: [Attackable] 무기
     */
    public void chageWeapon(Attackable weapon)
    {
        this.weapon = weapon;
    }

    /**
     * 캐릭터 정보 출력 함수
     */
    public void getInfo()
    {
        System.out.println("이름: " + NAME);
        System.out.println("체력: " + health);
        System.out.println("무기: " + weapon);
    }
}
```

캐릭터 클래스를 개선하였다. 저수준 모듈인 OneHandSword 를 파라미터에서 좀 더 고수준 모듈인 Attackable을 파라미터로 받아서 Attackable을 상속하는 모든 객체를 다룰 수 있게 되었다.

참조 : [[OOP] 객체지향 5원칙(SOLID) - 단일 책임 원칙 (Single Responsibility Principle) - 𝝅번째 알파카의 개발 낙서장](https://blog.itcode.dev/posts/2021/08/13/single-responsibility-principle)

<hr>

### 1.1.3 절차형 프로그래밍

#### 특징

- 코드 가독성이 좋고 컴퓨터 작업 처리방식과 유사하여 실행속도가 빠름
- 계산이 많은 작업에 사용 (연산, 머신러닝 배치 작업 등)
- 모듈화하기 어렵고 유지 보수가 어려움
- 엄격히 순서가 정해져 있음

<hr>
####비즈니스 로직이나 서비스 특징을 고려하여 적절한 패러다임을 선택하자

- 백엔드 머신러닝 파이프라인 : 절차지향형 패러다임
- 거래 관련 로직 : 함수형 프로그래밍
<hr>

# 2. 네트워크

## 2.1 네트워크 기초

### 2.1.1 처리량과 지연시간

- 네트워크 : 노드와 링크가 서 연결되어 있으며 리스ㄹ 공유하는 집합
- 노드 : 서버, 라우터, 스위치

- 처리량 : 링크를 통해 전달되는 단위 시간당 데이터양
  - 단위 : bps (bits per second)
  - 서버 트래픽, 네트워크 장치간의 대역폭, 에러, 네트워크 토폴로지, 장치 하드웨어 스팩에 영향받음
  - 대역폭 : 주어진 시간 동안 네트워크 연결을 통해 흐를 수 있는 최대 비트 수

* 지연 시간 : 요청이 처리되는 시간으로 어떠한 메시지가 두 장치 사이를 왕복하는데 걸린 시간으로 전송 + 요청 시간을 의미

  - 매체 타입 (무/유선), 지리적 거리, 전송 프로토콜, 패킷 크기, 라우터의 패킷 처리시간에 영향받음
  - 측정 방법 : 핑 시간
  - 단위 : ms

* 위 개선 방안
  - 캐싱
  - 전송 프로토콜 (TCP, UDP)
  - 서비스 품질(QoS)

### 2.1.2 네트워크 토폴로지와 병목현상

##### 네트워크 토폴로지

: 노드와 링크가 어떻게 배치되어있는지에 대한 방식이자 연결형태

네트워크 디바이스 수, 네트워크 링크의 대역폭, 네트워크 경로의 디바이스 간 거리 등을 포함함

- 트리 토폴로지

  - 계층형 토폴로지
  - 노드의 추가, 삭제가 쉬움
  - 특정 노드의 트래픽이 집중될 때 하위 노드에 영향을 미칠 수 있음

- 버스 토폴로지

  - 중앙 통신회선 하나에 여러개의 노드가 연결되어 공유하는 너트워크 구성
  - LAN에 사용
  - 설치비용이 적고 신뢰성 우수, 중앙통신회선에 노드 추가 삭제가 쉬움
  - 노드 수 증가시 배선 트래픽 증가, 스푸핑이 가능한 문제
  - 스푸핑 : LAN상 송신부의 패킷을 관련없는 다른 호스트에 가지 않도록 하는 스위칭 기능을 마비되거나 속여서 해당 패킷이 악의적인 노드에 오도록 처리하는 것

- 스타 토폴로지

  - 중앙에 있는 모든 노드에 연결된 네트워크 구성
  - 노드 추가하거나 에러를 탐지학 쉽고 패킷 충돌 발생 가능성이 적음
  - 에러 발생이 쉬우며 장애 노드가 중앙 노드가 아니면 미치는 영향이 크지 않음
  - 그러나 중앙 노드가 장애 발생시 모든 네트워크가 중단되되며 설치 비용이 고가

- 링형 토폴로지

  - 각 노드가 옆 두 노드와 연결하여 전체적으로 고리 형태를 이루는 네트워크 구성
  - 노드 수가 증가되어도 손실이 없고 충돌 가능성이 적음
  - 노드 고장 발견을 쉽게 찾을 수 있음
  - 네트워크 구성 변경이 어렵고 회선에 장애 생기면 전체 네트워크에 영향

- 메시 토폴로지
  - 모든 노드가 다른 노드에 그물망처럼 연결된 구조
  - 노드에 장애가 발생해도 경로가 많아 문제가 없으며 트래픽 분산 처리 가능
  - 노드 추가 어렵고 구축 및 운용 비용이 고가

\*\* 병목현상을 찾을 시 토폴로지가 중요한 기준이 됨

### 2.1.3 네트워크 분류

- LAN : 건물, 캠퍼스
- MAN : 도시
- WAN : 국가, 대륙

### 2.1.4 네트워크 성능 분석 명령어

#### 병목 현상

: 전체 시스템의 성능이나 용량이 하나의 구성요소로 인해 제한을 받는 현상

- 병목현상의 원인

  - 네트워크 대역 폭
  - 네트워크 토폴로지
  - 서버 CPU, 메모리 사용량
  - 비효율적인 네트워크 구성

- 원인 파악하는 법
  - 네트워크 관련 테스트 / 네트워크 무관한 테스트 구분하여 발생 원인이 네트워크인지 파악
  - 이후 네트워크 성능 분석

### 사용 명령어

- Ping

  - Packet INternet Grouper
  - 네트워크 상태를 확인하려는 대상 노드를 향해 일정 크기의 패킷을 전송하는 명령어
  - 이를 통해 해당 노드의 패킷 수신 상태와 도달하기 까지의 시간 등을 파악 > 해당 노드까지 네트워크가 잘 연결되어있는지 확인
  - ICMP 프로토콜을 통해 동작하여 이를 지원하지 않는 기기나 ICMP를 차단하는 대상인 경우 ping 테스팅 불가

- 관련 메서드 : icmp echo request - icmp echo reply

\\
원래는 PING 프로그램이 echo 요청을 하면 대상이 살아있을 때 응답을 해줘야 되는데 나쁜 목적으로 사용하는 일이 있기 때문에 요청이 무시되는 경우도 있다. 일단 해킹의 대상이 되는 장비가 살아있는지 확인하는 용도로 사용될 수 있기에, 만약 ping 응답이 없다면 장비가 꺼진 것인지, 라우팅이 연결안된 것인지, ping 응답을 거부하는 것인지 등을 먼저 확인해야 한다. 그리고, ping 을 과도하게 보내는 방법으로 DDoS 공격을 할 수 있기에 무시하도록 설정하는 경우가 많다. 참고로 개인용 윈도우는 ping 을 무시하도록 설정되어 있고, 굳이 필요하면 찾아서 켜야 한다.
\\

- netstat

  - 접속되어 있는 서비스들의 네트워크 상태를 표시하는데 사용되며 네트워크 접속, 라우팅 테이블, 네트워크 프로토콜 등의 리스트를 보여줌.
  - 주로 서비스의 포트가 열려있는지 확인할 때 씀

- nslookup

  - DNS에 관련 된 내용을 확인
  - 특정 도메인에 매핑된 IP를 확인하기 위해 사용
  - http 주소 & IP 주소!

- tracert (Linux : traceoute)
  - 목적지 노드까지 네트워크 경로를 확인하는 명령어
  - 목적지 노드까지 구간 (홉) 중 어느 구간에서 응답이 느려지는지 확인 가능
  - ping과 마찬가지로 목적지에 ICMP 패킷을 보내는 방식으로 작동
  - 패킷 이동 경로, 라우터 정보, 경로 도착 시간을 알 수 있다.
  - TTL (Time To Live) : 패킷이 폐기되기 전 최대 몇 개의 홉을 이동할 수 있는지 명시한 정보

### 2.1.5 네트워크 프로토콜 표준화

네트워크 프로토콜이란 상이한 소프트웨어와 하드웨어를 사용하는 다른 장치들끼리 데이터를 주고받기 위해데이터 서식 지정 및 처리를 위한 규칙을 설정한 공통의 인터페이스 (by IEEE, IETF)

== 공통언어

- IEEE802.3 : 유선 LAN 프로토콜

- HTTP : 웹을 접속할 때의 서로 약속된 인터페이스, 이를 통해 웹서비스를 기반으로 노드들은 데이터를 주고받음
